export interface Product {
  id: number;
  name: string;
  price: number;
  description: string;
  link: string;
  img: string;
  rating: number;
}

export const products = [
  {
    id: 1,
    name: 'Книга Уайльд О.: Портрет Дориана Грея',
    price: 3.11,
    description: '"Портрет Дориана Грея" - самое знаменитое произведение Оскара Уайльда, единственный его роман, вызвавший в свое время шквал негативных оценок и тем не менее имевший невероятный успех.',
    link: 'https://kaspi.kz/shop/p/uail-d-o-portret-doriana-greja-100996924/?c=750000000#!/item',
    img: 'https://resources.cdn-kaspi.kz/shop/medias/sys_master/images/images/hea/hc0/33377873952798/uajld-o-portret-doriana-grea-100996924-1-Container.jpg',
    rating: 9.5
  },
  {
    id: 2,
    name: 'Книга Коэльо П.: Алхимик',
    price: 5.71,
    description: 'Алхимик — самый известный роман бразильского писателя Пауло Коэльо, любимая книга миллионов людей во всем мире. В юности люди не боятся мечтать, все кажется им возможным. Но проходит время, и таинственная сила принимается им внушать, что их желания неосуществимы. Добиться воплощения Своей Судьбы — вот единственная подлинная обязанность человека... — утверждает Пауло Коэльо. Этот, ставший культовым, роман-притча способен изменить жизнь своих читателей.',
    link:'https://kaspi.kz/shop/p/koel-o-p-alhimik-26018156/?c=750000000#!/item',
    img:'https://resources.cdn-kaspi.kz/shop/medias/sys_master/images/images/h71/h43/31576355897374/koel-o-p-alkhimik-26018156-1.jpg',
    rating: 6.1
  },
  {
    id: 3,
    name: 'Книга Кристи А.: Немой свидетель',
    price: 3.71,
    description: 'Когда леди Аранделл неожиданно упала с лестницы своего собственного дома, все вокруг увидели в этом лишь несчастливую случайность - ведь она наступила на резиновый мячик, оставленный там ее любимцем, фокстерьером по кличке Боб. Но чем больше думала об этом сама пострадавшая, тем больше ей казалось, что падение подстроил кто-то из ее родственников. Она написала письмо знаменитому детективу Эркюлю Пуаро с просьбой разобраться в этом деле. Но за то время, пока письмо шло до адресата, леди Аранделл уже умерла, а ее немаленькое наследство перешло к компаньонке. Пуаро не в силах воскресить несчастную леди, но он может найти убийцу. А поможет ему в этом тот самый пес по кличке Боб…',
    link:'https://kaspi.kz/shop/p/kristi-a-nemoi-svidetel--26025053/?c=750000000#!/item',
    img: 'https://resources.cdn-kaspi.kz/shop/medias/sys_master/images/images/h04/h43/31836895084574/kristi-a-nemoj-svidetel-26025053-1-Container.jpg',
    rating: 8.2
  },
  {
    id: 4,
    name: 'Книга Киз Д.: Цветы для Элджернона',
    price: 5.08,
    description: '«Цветы для Элджернона» Дэниела Киза входят в программу обязательного чтения в американских школах. Эта единственная история в жанре научной фантастики, автор которой был дважды награжден сначала за рассказ, а потом за роман с одним и тем же названием, героем, сюжетом. Тридцатитрехлетний Чарли Гордон – умственно отсталый. При этом у него есть работа, друзья и непреодолимое желание учиться. Эта фантастическая история обладает поразительной психологической силой и заставляет задуматься над общечеловеческими вопросами нравственности: имеем ли мы право ставить друг над другом эксперименты, к каким результатам это может привести и какую цену мы готовы заплатить за то, чтобы стать «самым умным». А одиноким? На вопросы, которые поднимали еще М. Булгаков в «Собачьем сердце» и Дж. Лондон в «Мартине Идене», Дэниел Киз дает свой однозначный ответ.',
    link:'https://kaspi.kz/shop/p/kiz-d-tsvety-dlja-eldzhernona-100181228/?c=750000000#!/item',
    img: 'https://resources.cdn-kaspi.kz/shop/medias/sys_master/images/images/h09/ha5/32023453171742/kiz-d-cvety-dla-eldzernona-100181228-1-Container.jpg',
    rating: 8.5
  },
  {
    id: 5,
    name: 'Книга Сунь-цзы: Искусство войны',
    price: 3.03,
    description: 'Тот, кто знает, когда можно сражаться, а когда нельзя, одержит победу.Тот, кто понимает, как использовать большие и малые силы, одержит победу.Тот, у кого верхи и низы горят одним и тем же желанием, одержит победу.Тот, кто, будучи полностью готов, ждет неподготовленного, одержит победу.Совсем не обязательно вести военные действия, чтобы использовать принципы, сформулированные Сунь-цзы. Они равно применимы в политике, управлении и даже в повседневной жизни. Победителем мечтает стать каждый. Постижение древней мудрости и сегодня – шаг к победе',
    link:'https://kaspi.kz/shop/p/sun--tszy-iskusstvo-voiny-100579965/?c=750000000#!/item',
    img: 'https://resources.cdn-kaspi.kz/shop/medias/sys_master/images/images/hcf/h86/32988326723614/sun-czy-iskusstvo-vojny-100579965-1-Container.jpg',
    rating: 7.3
  },
  {
    id: 6,
    name: 'Книга Кристи А.: Убийство в Восточном экспрессе',
    price: 4.72,
    description: 'Находившийся в Стамбуле великий сыщик Эркюль Пуаро возвращается в Англию на знаменитом «Восточном экспрессе», в котором вместе с ним едут, кажется, представители всех возможных национальностей. Один из пассажиров, неприятный американец по фамилии Рэтчетт, предлагает Пуаро стать своим телохранителем, поскольку считает, что его должны убить. Знаменитый бельгиец отмахивается от этой абсурдной просьбы. А на следующий день американца находят мертвым в своем купе, причем двери закрыты, а окно открыто. Пуаро немедленно берется за расследование – и выясняет, что купе полно всевозможных улик, указывающих… практически на всех пассажиров «Восточного экспресса». Вдобавок поезд наглухо застревает в снежных заносах в безлюдном месте. Пуаро необходимо найти убийцу до того, как экспресс продолжит свой путь…',
    link:'https://kaspi.kz/shop/p/kristi-a-ubiistvo-v-vostochnom-ekspresse-100015045/?c=750000000#!/item',
    img: 'https://resources.cdn-kaspi.kz/shop/medias/sys_master/images/images/h0d/hdd/31992848056350/kristi-a-ubijstvo-v-vostocnom-ekspresse-100015045-1-Container.jpg',
    rating: 9.1
  },
  {
    id: 7,
    name: 'Книга Бeрнетт Ф. Э. Х.: Таинственный сад',
    price: 4.26,
    description: 'В центре романа "Таинственный сад" - десятилетняя Мери Леннокс, вернувшаяся из Индии в Англию после смерти родителей. В поместье ее дяди Арчибальда Крэвена Мери вынуждена привыкать к совершенно другой жизни, непохожей на ту, что была у нее до сих пор. Однажды девочка узнает о загадочном заброшенном саде, в который запрещено входить, и решает разыскать его. Вместе с новыми друзьями Мери предстоит проникнуть в тайны этого удивительного места, преображающего души людей.',
    link:'https://kaspi.kz/shop/p/bernett-f-e-h-tainstvennyi-sad-101375607/?c=750000000#!/item',
    img: 'https://resources.cdn-kaspi.kz/shop/medias/sys_master/images/images/hff/hc6/34300229976094/bernett-f-e-h-tainstvennyj-sad-101375607-1.jpg',
    rating: 8.3
  },
  {
    id: 8,
    name: 'Книга Паланик Ч.: Бойцовский клуб',
    price: 5.55,
    description: '«Бойцовский клуб» — самый знаменитый роман Чака Паланика. Все помнят фильм режиссера Дэвида Финчера с Брэдом Питтом в главной роли? Он именно по этой книге. Это роман-вызов, роман, созданный всем назло и вопреки всему, в нем описывается поколение озлобившихся людей, потерявших представление о том, что можно и чего нельзя, где добро и зло, кто они сами и кто их окружает. Сам Паланик называет свой «Бойцовский клуб» новым «Великим Гэтсби». Какие же они — эти Гэтсби конца XX века?',
    link:'https://kaspi.kz/shop/p/palanik-ch-boitsovskii-klub-104155644/?c=750000000#!/item',
    img: 'https://resources.cdn-kaspi.kz/shop/medias/sys_master/images/images/hb7/hdd/49416727691294/palanik-c-bojcovskij-klub-104155644-1.jpg',
    rating: 9.3
  },
  {
    id: 9,
    name: 'Книга Джио С.: Ежевичная зима',
    price: 4.45,
    description: 'Сиэтл, 1933. Мать-одиночка Вера Рэй целует своего маленького сына Дэниела перед сном и уходит на ночную работу в местную гостиницу. Утром она обнаруживает, что город утопает в снегу, а ее сын исчез. Недалеко от дома, в сугробе, Вера находит любимого плюшевого медвежонка Дэниела, но больше никаких следов на заледеневшей дороге нет. Однако Вера не привыкла сдаваться, она сделает все, чтобы найти пропавшего ребенка! Сиэтл, 2010. Репортер Клэр Олдридж пишет очерк о парализовавшем город первомайском снежном буране. Оказывается, похожее ненастье уже было почти восемьдесят лет назад, и во время снегопада пропал мальчик. Клэр без энтузиазма берется за это дело, но вскоре обнаруживает, что история Веры Рэй переплетена с ее собственной судьбой самым неожиданным образом...',
    link:'https://kaspi.kz/shop/p/dzhio-s-ezhevichnaja-zima-26025116/?c=750000000#!/item',
    img: 'https://resources.cdn-kaspi.kz/shop/medias/sys_master/images/images/h0b/hab/49748869218334/dzio-s-ezevicnaa-zima-26025116-1-Container.jpg',
    rating: 3.2
  },
  {
    id: 10,
    name: 'Книга Ремарк Э. М.: Триумфальная арка',
    price: 6.39,
    description: '«Триумфальная арка» – пронзительная история любви всему наперекор, любви, приносящей боль, но и дарующей бесконечную радость. Место действия – Париж накануне Второй мировой войны. Герой – беженец из Германии, без документов, скрывающийся и от французов, и от нацистов, хирург, спасающий человеческие жизни. Героиня – итальянская актриса, окруженная поклонниками, вспыльчивая, как все артисты, прекрасная и неотразимая. И время, когда влюбленным довелось встретиться, и город, пронизанный ощущением надвигающейся катастрофы, становятся героями этого романа. «Триумфальная арка» была дважды экранизирована и по-прежнему покоряет читателей всего мира.',
    link:'https://kaspi.kz/shop/p/remark-e-m-triumfal-naja-arka-26025852/?c=750000000#!/item',
    img: 'https://resources.cdn-kaspi.kz/shop/medias/sys_master/images/images/h0d/h7d/31836880076830/remark-e-m-triumfalnaa-arka-26025852-1-Container.jpg',
    rating: 9.4
  }
];


/*
Copyright Google LLC. All Rights Reserved.
Use of this source code is governed by an MIT-style license that
can be found in the LICENSE file at https://angular.io/license
*/